public class Data {

	private int splav = -1;
	private int vidLitya = -1;
	private int razmGroup = -1;
	private double kIzb = -1;
	private int dupleks = 0; // 0 - одинарный переплав 1 - двойной
	private double b_v_potery = -1;
	private double othods = -1;
	private double mDet = -1;
	private double mOtl = -1;
	private double mOtlSLps = -1;
	private double percentOfbrak = -1;
	private double percentOfNewMetall = -1;
	private double mObrazcov = -1;

	private double b_v_potery_chugun[][] = {

			// один , дуплекс
			{ 3.39, 4.39 }, // песчаные формы 0
			{ 3.39, 4.39 }, // оболочковые формы 1
			{ 3.40, 4.40 }, // литье в кокиль 2
			{ 0.0, 0.0 }, // ЛВМ 3
			{ 0.0, 0.0 }, // Литье давлением 4
			{ 0.0, 0.0 }, // Литье выжиманием 5
	};

	private double b_v_potery_staliKonstr[][] = {

			// от 0,25 0,63 1,60 4,00 10,00 25,00 63,00 160,0
			// до. 0,25 0,63 1,60 4,00 10,00 25,00 63,00 160,0
			{ 2.40, 2.40, 2.37, 2.37, 2.35, 2.35, 2.32, 2.32, 2.32 }, // песчаные
																		// формы
																		// 0
			{ 2.40, 2.40, 2.37, 2.37, 2.35, 2.35, 2.32, 2.32, 2.32 }, // оболочковые
																		// формы
																		// 1
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // литье в кокиль 2
			{ 2.40, 2.40, 2.40, 2.40, 2.35, 2.35, 2.32, 2.32, 2.32 }, // ЛВМ 3
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // Литье давлением
																// 4
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // Литье выжиманием
																// 5
	};

	private double b_v_potery_zharoProch[][] = {
			// от 0,25 0,63 1,60 4,00 10,00 25,00 63,00 160,0
			// до. 0,25 0,63 1,60 4,00 10,00 25,00 63,00 160,0
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // песчаные формы
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // оболочковые
																// формы
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // литье в кокиль
			{ 2.00, 2.00, 1.90, 1.90, 1.90, 1.90, 1.85, 1.85, 1.85 }, // ЛВМ
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // Литье давлением
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // Литье выжиманием
	};

	private double b_v_potery_aluminii[][] = {

			// один , дуплекс
			{ 2.30, 4.40 }, // песчаные формы 0
			{ 2.25, 2.25 }, // оболочковые формы 1
			{ 2.20, 4.30 }, // литье в кокиль 2
			{ 2.25, 2.25 }, // ЛВМ 3
			{ 2.20, 4.30 }, // Литье давлением 4
			{ 2.35, 2.35 }, // Литье выжиманием 5
	};

	private double b_v_potery_magnii[][] = {

			// один , дуплекс
			{ 4.20, 5.20 }, // песчаные формы 0
			{ 4.15, 5.15 }, // оболочковые формы 1
			{ 4.10, 5.10 }, // литье в кокиль 2
			{ 0.0, 0.0 }, // ЛВМ 3
			{ 0.0, 0.0 }, // Литье давлением 4
			{ 0.0, 0.0 }, // Литье выжиманием 5
	};

	private double othods_chugun[][] = {

			// один , дуплекс
			{ 2.00, 2.00 }, // песчаные формы 0
			{ 2.00, 2.00 }, // оболочковые формы 1
			{ 2.00, 2.00 }, // литье в кокиль 2
			{ 0.0, 0.0 }, // ЛВМ 3
			{ 0.0, 0.0 }, // Литье давлением 4
			{ 0.0, 0.0 }, // Литье выжиманием 5
	};

	private double othods_staliKonstr[][] = {

			// от 0,25 0,63 1,60 4,00 10,00 25,00 63,00 160,0
			// до. 0,25 0,63 1,60 4,00 10,00 25,00 63,00 160,0
			{ 2.20, 2.20, 1.88, 1.88, 1.60, 1.60, 1.43, 1.43, 1.43 }, // песчаные
																		// формы
																		// 0
			{ 2.30, 2.30, 1.98, 1.98, 1.70, 1.70, 1.53, 1.53, 1.53 }, // оболочковые
																		// формы
																		// 1
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // литье в кокиль 2
			{ 2.60, 2.60, 2.20, 2.20, 1.95, 1.95, 1.78, 1.78, 1.78 }, // ЛВМ 3
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // Литье давлением
																// 4
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // Литье выжиманием
																// 5
	};

	private double othods_zharoProch[][] = {
			// от 0,25 0,63 1,60 4,00 10,00 25,00 63,00 160,0
			// до. 0,25 0,63 1,60 4,00 10,00 25,00 63,00 160,0
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // песчаные формы
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // оболочковые
																// формы
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // литье в кокиль
			{ 2.35, 2.35, 1.95, 1.95, 1.65, 1.65, 1.40, 1.40, 1.40 }, // ЛВМ
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // Литье давлением
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // Литье выжиманием
	};

	private double othods_aluminii[][] = {

			// один , дуплекс
			{ 2.20, 2.50 }, // песчаные формы 0
			{ 2.0, 2.0 }, // оболочковые формы 1
			{ 1.90, 2.20 }, // литье в кокиль 2
			{ 2.15, 2.15 }, // ЛВМ 3
			{ 1.00, 1.30 }, // Литье давлением 4
			{ 1.00, 1.00 }, // Литье выжиманием 5
	};

	private double othods_magnii[][] = {

			// один , дуплекс
			{ 3.60, 4.60 }, // песчаные формы 0
			{ 3.25, 4.25 }, // оболочковые формы 1
			{ 3.40, 4.40 }, // литье в кокиль 2
			{ 0.0, 0.0 }, // ЛВМ 3
			{ 0.0, 0.0 }, // Литье давлением 4
			{ 0.0, 0.0 }, // Литье выжиманием 5
	};

	private double kIzb_chugun[][] = {

			// один , дуплекс
			{ 1.06, 1.07 }, // песчаные формы 0
			{ 1.06, 1.07 }, // оболочковые формы 1
			{ 1.06, 1.08 }, // литье в кокиль 2
			{ 0.0, 0.0 }, // ЛВМ 3
			{ 0.0, 0.0 }, // Литье давлением 4
			{ 0.0, 0.0 }, // Литье выжиманием 5
	};

	private double kIzb_staliKonstr[][] = {

			// от 0,25 0,63 1,60 4,00 10,00 25,00 63,00 160,0
			// до. 0,25 0,63 1,60 4,00 10,00 25,00 63,00 160,0
			{ 1.03, 1.03, 1.03, 1.03, 1.03, 1.03, 1.03, 1.03, 1.03 }, // песчаные
																		// формы
																		// 0
			{ 1.03, 1.03, 1.03, 1.03, 1.03, 1.03, 1.03, 1.03, 1.03 }, // оболочковые
																		// формы
																		// 1
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // литье в кокиль 2
			{ 1.04, 1.04, 1.04, 1.04, 1.04, 1.04, 1.04, 1.04, 1.04 }, // ЛВМ 3
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // Литье давлением
																// 4
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // Литье выжиманием
																// 5
	};

	private double kIzb_zharoProch[][] = {
			// от 0,25 0,63 1,60 4,00 10,00 25,00 63,00 160,0
			// до. 0,25 0,63 1,60 4,00 10,00 25,00 63,00 160,0
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // песчаные формы
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // оболочковые
																// формы
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // литье в кокиль
			{ 1.02, 1.02, 1.02, 1.02, 1.02, 1.02, 1.02, 1.02, 1.02 }, // ЛВМ
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // Литье давлением
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // Литье выжиманием
	};

	private double kIzb_aluminii[][] = {

			// один , дуплекс
			{ 1.04, 1.07 }, // песчаные формы 0
			{ 1.04, 1.04 }, // оболочковые формы 1
			{ 1.04, 1.07 }, // литье в кокиль 2
			{ 1.05, 1.05 }, // ЛВМ 3
			{ 1.04, 1.07 }, // Литье давлением 4
			{ 1.04, 1.04 }, // Литье выжиманием 5
	};

	private double kIzb_magniiZr[][] = {

			// один , дуплекс
			{ 1.40, 1.43 }, // песчаные формы 0
			{ 1.39, 1.43 }, // оболочковые формы 1
			{ 1.39, 1.43 }, // литье в кокиль 2
			{ 0.0, 0.0 }, // ЛВМ 3
			{ 0.0, 0.0 }, // Литье давлением 4
			{ 0.0, 0.0 }, // Литье выжиманием 5
	};

	private double kIzb_magniiAl[][] = {

			// один , дуплекс
			{ 1.30, 1.34 }, // песчаные формы 0
			{ 1.30, 1.33 }, // оболочковые формы 1
			{ 1.30, 1.34 }, // литье в кокиль 2
			{ 0.0, 0.0 }, // ЛВМ 3
			{ 0.0, 0.0 }, // Литье давлением 4
			{ 0.0, 0.0 }, // Литье выжиманием 5
	};

	// Коэффициенты соотношения массы отливки и массы литой детали

	private double k1_chugun[][] = {

			// от 0,25 0,63 1,60 4,00 10,00 25,00 63,00 160,0
			// до. 0,25 0,63 1,60 4,00 10,00 25,00 63,00 160,0
			{ 2.05, 1.90, 1.77, 1.64, 1.52, 1.41, 1.31, 1.22, 1.13 }, // песчаные
																		// формы
																		// 0
			{ 1.80, 1.68, 1.57, 1.47, 1.57, 1.28, 1.20, 1.12, 0.0 }, // оболочковые
																		// формы
																		// 1
			{ 1.75, 1.64, 1.54, 1.44, 1.35, 1.27, 1.18, 1.11, 0.0 }, // литье в
																		// кокиль
																		// 2
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // ЛВМ 3
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // Литье давлением
																// 4
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // Литье выжиманием
																// 5
	};

	private double k1_staliKonstr[][] = {
			// от 0,25 0,63 1,60 4,00 10,00 25,00 63,00 160,0
			// до. 0,25 0,63 1,60 4,00 10,00 25,00 63,00 160,0
			{ 1.95, 1.82, 1.70, 1.58, 1.48, 1.38, 1.28, 1.20, 1.12 }, // песчаные
																		// формы
			{ 1.50, 1.44, 1.37, 1.31, 1.25, 1.20, 1.15, 1.11, 0.0 }, // оболочковые
																		// формы
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // литье в кокиль
			{ 1.43, 1.37, 1.31, 1.25, 1.19, 1.14, 1.10, 0.0, 0.0 }, // ЛВМ
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // Литье давлением
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // Литье выжиманием
	};

	private double k1_zharoProch[][] = {
			// от 0,25 0,63 1,60 4,00 10,00 25,00 63,00 160,0
			// до. 0,25 0,63 1,60 4,00 10,00 25,00 63,00 160,0
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // песчаные формы
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // оболочковые
																// формы
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // литье в кокиль
			{ 1.52, 1.44, 1.37, 1.31, 1.24, 1.18, 1.12, 0.0, 0.0 }, // ЛВМ
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // Литье давлением
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // Литье выжиманием
	};

	private double k1_aluminii[][] = {
			// от 0,25 0,63 1,60 4,00 10,00 25,00 63,00 160,0
			// до. 0,25 0,63 1,60 4,00 10,00 25,00 63,00 160,0
			{ 1.70, 1.63, 1.56, 1.50, 1.44, 1.38, 1.32, 1.27, 1.22 }, // песчаные
																		// формы
			{ 1.60, 1.52, 1.45, 1.38, 1.31, 1.25, 0.0, 0.0, 0.0 }, // оболочковые
																	// формы
			{ 1.55, 1.49, 1.42, 1.36, 1.30, 1.24, 1.18, 1.13, 0.0 }, // литье в
																		// кокиль
			{ 1.38, 1.34, 1.30, 1.26, 1.22, 1.19, 1.16, 0.0, 0.0 }, // ЛВМ
			{ 1.35, 1.31, 1.28, 1.25, 1.21, 1.18, 1.15, 1.12, 1.10 }, // Литье
																		// давлением
			{ 0.0, 0.0, 0.0, 1.55, 1.50, 1.45, 1.40, 1.36, 0.0 }, // Литье
																	// выжиманием
	};

	private double k1_magnii[][] = {
			// от 0,25 0,63 1,60 4,00 10,00 25,00 63,00 160,0
			// до. 0,25 0,63 1,60 4,00 10,00 25,00 63,00 160,0
			{ 1.65, 1.59, 1.53, 1.47, 1.41, 1.35, 1.30, 1.25, 1.20 }, // песчаные
																		// формы
			{ 1.50, 1.43, 1.37, 1.31, 1.25, 1.20, 0.0, 0.0, 0.0 }, // оболочковые
																	// формы
			{ 1.45, 1.39, 1.33, 1.28, 1.23, 1.19, 1.14, 1.10, 0.0 }, // литье в
																		// кокиль
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // ЛВМ
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // Литье давлением
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // Литье выжиманием
	};

	// Коэффициенты соотношения массы отливки с ЛПС и массы отливки

	private double k2_chugun[][] = {

			// от 0,25 0,63 1,60 4,00 10,00 25,00 63,00 160,0
			// до. 0,25 0,63 1,60 4,00 10,00 25,00 63,00 160,0
			{ 2, 40, 2.23, 2.07, 1.93, 1.79, 1.66, 1.55, 1.45, 1.35 }, // песчаные
																		// формы
			{ 2.30, 2.15, 2.00, 1.88, 1.75, 1.64, 1.53, 1.43, 0.0 }, // оболочковые
																		// формы
			{ 2.25, 2.10, 1.96, 1.83, 1.71, 1.60, 1.49, 1.39, 0.0 }, // литье в
																		// кокиль
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // ЛВМ
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // Литье давлением
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // Литье выжиманием
	};

	private double k2_staliKonstr[][] = {
			// от 0,25 0,63 1,60 4,00 10,00 25,00 63,00 160,0
			// до. 0,25 0,63 1,60 4,00 10,00 25,00 63,00 160,0
			{ 2.55, 2.36, 2.19, 2.02, 1.87, 1.73, 1.60, 1.48, 1.37 }, // песчаные
																		// формы
			{ 2.45, 2.28, 2.12, 1.97, 1.83, 1.70, 1.58, 1.47, 0.0 }, // оболочковые
																		// формы
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // литье в кокиль
			{ 3.27, 2.92, 2.61, 2.33, 2.08, 1.86, 1.66, 0.0, 0.0 }, // ЛВМ
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // Литье давлением
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // Литье выжиманием
	};

	private double k2_zharoProch[][] = {
			// от 0,25 0,63 1,60 4,00 10,00 25,00 63,00 160,0
			// до. 0,25 0,63 1,60 4,00 10,00 25,00 63,00 160,0
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // песчаные формы
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // оболочковые
																// формы
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // литье в кокиль
			{ 4.87, 4.12, 3.50, 2.96, 2.51, 2.13, 1.80, 0.0, 0.0 }, // ЛВМ
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // Литье давлением
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // Литье выжиманием
	};

	private double k2_aluminii[][] = {
			// от 0,25 0,63 1,60 4,00 10,00 25,00 63,00 160,0
			// до. 0,25 0,63 1,60 4,00 10,00 25,00 63,00 160,0
			{ 3.60, 3.25, 2.96, 2.69, 2.45, 2.22, 2.02, 1.84, 1.67 }, // песчаные
																		// формы
			{ 3.00, 2.69, 2.37, 2.09, 1.84, 1.62, 0.0, 0.0, 0.0 }, // оболочковые
																	// формы
			{ 2.50, 2.29, 2.09, 1.91, 1.75, 1.60, 1.46, 1.34, 0.0 }, // литье в
																		// кокиль
			{ 3.40, 2.94, 2.55, 2.21, 1.91, 1.65, 1.43, 0.0, 0.0 }, // ЛВМ
			{ 2.20, 2.05, 1.90, 1.77, 1.65, 1.53, 1.43, 1.33, 1.24 }, // Литье
																		// давлением
			{ 0.0, 0.0, 0.0, 4.00, 3.60, 3.30, 3.00, 2.80, 0.0 }, // Литье
																	// выжиманием
	};

	private double k2_magnii[][] = {
			// от 0,25 0,63 1,60 4,00 10,00 25,00 63,00 160,0
			// до. 0,25 0,63 1,60 4,00 10,00 25,00 63,00 160,0
			{ 4.20, 3.83, 3.30, 3.20, 2.93, 2.68, 2.45, 2.24, 2.04 }, // песчаные
																		// формы
			{ 3.55, 3.16, 2.80, 2.49, 2.22, 1.97, 0.0, 0.0, 0.0 }, // оболочковые
																	// формы
			{ 3.40, 3.11, 2.84, 2.59, 2.36, 2.16, 1.97, 1.40, 0.0 }, // литье в
																		// кокиль
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // ЛВМ
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // Литье давлением
			{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // Литье выжиманием
	};

	/*
	 * чугун - 0 стали - 1 жаропрочные стали - 2 алюминий - 3 магний Cr - 4
	 * магний Al - 5
	 */

	public void setSplav(String splav) {
		try {
			switch (splav) {
			case "Чугуны":
				this.splav = 0;
				break;
			case "Констр. стали":
				this.splav = 1;
				break;
			case "Жаропроч. стали":
				this.splav = 2;
				break;
			case "Алюминий":
				this.splav = 3;
				break;
			case "Магний с сод. Cr":
				this.splav = 4;
				break;
			case "Магний с сод. Al":
				this.splav = 5;
				break;
			}
		} catch (Exception e) {
			System.out.println("Ошибка при установке сплава");
		}

	}

	public int getSplav() {
		return splav;
	}

	/*
	 * Песчаные формы - 0 оболочковы формы - 1 литье в кокиль - 2 ЛВМ - 3 литье
	 * под давлением - 4 литье выжиманием - 5
	 */

	public void setVidLitya(String vidLitya) {
		try {
			switch (vidLitya) {
			case "В песчаные формы":
				this.vidLitya = 0;
				break;
			case "В оболочковые формы":
				this.vidLitya = 1;
				break;
			case "В кокиль":
				this.vidLitya = 2;
				break;
			case "ЛВМ":
				this.vidLitya = 3;
				break;
			case "Под давлением":
				this.vidLitya = 4;
				break;
			case "Выжиманием":
				this.vidLitya = 5;
				break;

			}
		} catch (Exception e) {
			System.out.println("Ошибка при установке вида литья");
		}

	}

	public int getVidLitya() {
		return vidLitya;
	}

	public void setRazmGroup(double mDet) {
		if (mDet < 0.25) {
			razmGroup = 0;
		} else if (mDet > 0.25 && mDet <= 0.63) {
			razmGroup = 1;
		} else if (mDet > 0.63 && mDet <= 1.60) {
			razmGroup = 2;
		} else if (mDet > 1.60 && mDet <= 4.0) {
			razmGroup = 3;
		} else if (mDet > 4.0 && mDet <= 10.0) {
			razmGroup = 4;
		} else if (mDet > 10.0 && mDet <= 25.0) {
			razmGroup = 5;
		} else if (mDet > 25.0 && mDet <= 63.0) {
			razmGroup = 6;
		} else if (mDet > 63.0 && mDet <= 160.0) {
			razmGroup = 7;
		} else if (mDet > 160.0) {
			razmGroup = 8;
		}
	}

	public int getRazmGroup() {
		return razmGroup;

	}

	public void setmDet(double mDet) {

		if (mDet > 0) {
			this.mDet = mDet;
			setRazmGroup(mDet);
		}

	}

	public double getmDet() {

		return mDet;
	}

	public double getmOtl() {
		return mOtl;
	}

	public void setmOtl(double mOtl) {

		if (mOtl <= 0) {
			setmOtl(getVidLitya(), getRazmGroup());
		} else {
			this.mOtl = mOtl;

		}

	}

	public void setmOtl(int i, int j) {

		double k1 = -1;

		switch (splav) {
		case 0:
			k1 = k1_chugun[i][j];
			break;
		case 1:
			k1 = k1_staliKonstr[i][j];
			break;
		case 2:
			k1 = k1_zharoProch[i][j];
			break;
		case 3:
			k1 = k1_aluminii[i][j];
			break;
		case 4:
			k1 = k1_magnii[i][j];
			break;
		case 5:
			k1 = k1_magnii[i][j];
			break;

		}
		mOtl = mDet * k1;

		setRazmGroup(mOtl);

	}

	public double getmOtlSLps() {
		return mOtlSLps;
	}

	public void setmOtlSLps(double mOtlSLps) {
		if (mOtlSLps >= 0) {
			this.mOtlSLps = mOtlSLps;
		} else
			setmOtlSLps(getVidLitya(), getRazmGroup());

	}

	public void setmOtlSLps(int i, int j) {
		double k2 = -1;

		switch (splav) {
		case 0:
			k2 = k2_chugun[i][j];
			break;
		case 1:
			k2 = k2_staliKonstr[i][j];
			break;
		case 2:
			k2 = k2_zharoProch[i][j];
			break;
		case 3:
			k2 = k2_aluminii[i][j];
			break;
		case 4:
			k2 = k2_magnii[i][j];
			break;
		case 5:
			k2 = k2_magnii[i][j];
			break;

		}
		mOtlSLps = mOtl * k2;
	}

	public double getPercentOfbrak() {
		return percentOfbrak;
	}

	public void setPercentOfbrak(double percentOfbrak) {
		this.percentOfbrak = percentOfbrak;
	}

	public double getPercentOfNewMetall() {
		return percentOfNewMetall;
	}

	public void setPercentOfNewMetall(double percentOfNewMetall) {
		this.percentOfNewMetall = percentOfNewMetall;
	}

	public double getkIzb() {
		return kIzb;
	}

	public void setkIzb() {

		if (splav == 0) {
			kIzb = kIzb_chugun[vidLitya][dupleks];
		} else if (splav == 1) {
			kIzb = kIzb_staliKonstr[vidLitya][razmGroup];
		} else if (splav == 2) {
			kIzb = kIzb_zharoProch[vidLitya][razmGroup];
		} else if (splav == 3) {
			kIzb = kIzb_aluminii[vidLitya][dupleks];
		} else if (splav == 4) {
			kIzb = kIzb_magniiZr[vidLitya][dupleks];
		} else if (splav == 5) {
			kIzb = kIzb_magniiAl[vidLitya][dupleks];
		}

	}

	public double getB_v_potery() {
		return b_v_potery;
	}

	public void setB_v_potery() {

		if (splav == 0) {
			this.b_v_potery = b_v_potery_chugun[vidLitya][dupleks];
		} else if (splav == 1) {
			this.b_v_potery = b_v_potery_staliKonstr[vidLitya][razmGroup];
		} else if (splav == 2) {
			this.b_v_potery = b_v_potery_zharoProch[vidLitya][razmGroup];
		} else if (splav == 3) {
			this.b_v_potery = b_v_potery_aluminii[vidLitya][dupleks];
		} else if (splav == 4) {
			this.b_v_potery = b_v_potery_magnii[vidLitya][dupleks];
		} else if (splav == 5) {
			this.b_v_potery = b_v_potery_magnii[vidLitya][dupleks];
		}

	}

	public int getDupleks() {
		return dupleks;
	}

	public void setDupleks(boolean dupleks) {
		if (dupleks) {
			this.dupleks = 1;
		}

	}

	public double getOthods() {
		return othods;
	}

	public void setOthods() {
		if (splav == 0) {
			othods = othods_chugun[vidLitya][dupleks];
		} else if (splav == 1) {
			othods = othods_staliKonstr[vidLitya][razmGroup];
		} else if (splav == 2) {
			othods = othods_zharoProch[vidLitya][razmGroup];
		} else if (splav == 3) {
			othods = othods_aluminii[vidLitya][dupleks];
		} else if (splav == 4) {
			othods = othods_magnii[vidLitya][dupleks];
		} else if (splav == 5) {
			othods = othods_magnii[vidLitya][dupleks];
		}

	}

	public double getmObrazcov() {
		return mObrazcov;
	}

	public void setmObrazcov(double mObrazcov) {
		this.mObrazcov = mObrazcov;

	}

}
